# SSC Data Science and Analytics Workshop 2022

### [Intro to Databases in Industry: Data Cleaning, Querying, and Modeling at Scale](https://ssc.ca/en/meetings/annual/2022-annual-meeting/workshops/data-science-and-analytics)

Speakers:
- **Rodolfo Lourenzutti**, University of British Columbia
- **Arman Seyed-Ahmadi**, University of British Columbia
- **Diego Ardila**, Shopify

---

# 1. Introduction

### 1.1 Workshop structure

The workshop will be split in two parts. 

- In the first part, Arman and I will discuss
    - what it is and why to use a Database Management Systems (DBMS);
    - the basics of SQL queries;
    - accessing a database from R;
    
    
    
- In the second part, Diego will:
   - discuss the concept of a data warehouse;
   - introduce the ETL (Extract, Transform, Load) and ELT (Extract, Load, Transform) processes;
   - present dimensional modelling as methodology to guide the design of data warehouses at scale.
   
The workshop will be focused on the user aspect of databases, not on design and implementation.

### 1.2 Why use a Database management system (DBMS)?

To analyze data, we need to first collect and store the data. In fact, depending on the scale of the dataset, we need much more than that. Curating a large dataset is not just about storing it, we also need to:

- keep track of the relationship between the data entities;
- avoid redundancies; 
- manage security issues to protect private and sensitive information;
- have an error recovery system in place;
- be able to retrieve data in an efficient manner;
- have well controlled concurrent access;
- keep the data in a consistent state;
- enforce data integrity!

### 1.3 Database vs DBMS 

- A **database is a collection of data about different but related objects** (also called entities in database jargon), each entity with a common set of attributes. For example, a taxi company stores information about:
  - Drivers (name, licence number, licence expiration);
  - Cars (model, year);
  - Clients (name, address, phone, e-mail);


- Note that entities also interact among themselves (e.g., a driver drives a car).

- A **DBMS is a software** responsible to assist the maintenance and usage of databases (yes, plural!)
  - There are many different vendors of **relational** DBMS out there (e.g., PostgreSQL, MS Access, MS SQL Server, MySQL, etc…)
  <img src="img/flavours_sql.png" width="700"/>

---

**Remember:**
    
database $\ne$ database management system

---

### 1.4 PostgreSQL

- In this workshop we will be using PostgreSQL as our RDBMS;


- PostgreSQL is an open-source multi-platform (Windows, Linux, macOS) RDBMS with a high level of compliance with ANSI SQL (the langugae that practically all RDBMS use to create, modify and query databases);

### 1.5 The client-server model

Similar to most other DBMSs, Postgres works based on a **client-sever** model. In this model

- The DBMS along with its databases and data are all stored on a host computer where the database server resides. This is typically a powerful machine with high processing power and large storage
- Client hosts are usually personal computers with GUIs that can connect to a database server to access the data.

In this model, the clients and the server are connected over a network. The heavy-lifting of processing, managing and storing large amounts of data is done by the server host, and clients only retrieve the data that they need.

<img src="img/client-server.png" width="500"/>

> Although sometimes used interchangeably, there is a difference between a **client/server** and a **client/server host**. A host is a device, whereas a client/server is a piece of software. For example, you can simultaneously have multiple client programs connected to a remote database. Similarly, a remote host is a device (i.e. a computer) that might have several server programs running concurrently.

The idea of client-server models for databases has become the standard of computation and storage today, known as **cloud computing**:

- Today we rarely store movie or music files on our computers. This is why most of us have laptops with only 256/512 GB of space, because most of that takes up space is already provided as a cloud service (e.g. Netflix, Spotify, Youtube), or is stored on cloud storage spaces (e.g. One Drive, Dropbox, Google Drive).
- We rarely run production-stage computation-intensive jobs on our own computers. All such computations are done on cloud-computing services (e.g. Google Cloud Platform, Amazon Web Services, Microsoft Azure). I personally haven't run a single simulation code on my own computer, neither ever stored any raw data locally. I use my computer mainly as an interface to access the services that I want.

> Note that there are certain situations where one might want to **locally** benefit from the advantages of storing data in a database. A relational database engine that works only with local databases is SQLite. If you're curious to find out the use cases for **SQLite**, take a look [here](https://www.sqlite.org/whentouse.html).

Whenever we use Postgres (or any other client-server DBMS), the first step before anything else is to **connect** to the database server. This is why we will talk about _host address_, _port_, _username_, and _password_ when we try to use a database.

### 1.5 What is SQL?

Well, it's finally time to learn about SQL!

- SQL stands for Structured Query Language ([or... does it?](https://en.wikipedia.org/wiki/SQL#History)).

- It is a language that we use to talk to a relational DBMS.

- Originally developed by IBM in 1970s to manipulate and retrieve data stored in their DBMS, System R.

- Keep in mind that SQL is not set in stone and the SQL standard is updated from time to time (e.g., 1986, 1992, 1999, 2011, 2016);

- There’s no DBMS that fully complies with the standard;

## 2. SQL

Suppose that we have the following table in our database, and 

> we want to retrieve the names and GPAs of students older than 25.

|  sid  | name      | login      | age | gpa |
|-------|-----------|------------|-----|-----|
| 23792 | Arman     | arman@mds  | 28  | 2.5 |
| 82347 | Varada    | varada@mds | 29  | 2.9 |
| 11238 | Tiffany   | tiff@mds   | 23  | 2.8 |
| 87263 | Mike      | mike@mds   | 19  | 3.8 |
| 13298 | Joel      | joel@mds   | 25  | 3.2 |
| 91287 | Florencia | flor@mds   | 20  | 3.3 |

We can write this as the following SQL query:

```sql
SELECT
    name, age, gpa
FROM
    Students
WHERE
    age > 25;
```

Running the above query should return this relation:

| name   | age | gpa |
|--------|-----|-----|
| Arman  | 28  | 2.5 |
| Varada | 29  | 2.9 |

Let's dissect the different parts of our SQL query here.

### 2.1 The `SELECT` statement

```sql
-- A basic SELECT statement
-- ===========================
SELECT
    name, age, gpa  -- column names
FROM
    Students        -- table name
WHERE
    age > 25;       -- condition
```

- A SQL statement usually starts with a verb that describes what the statement is doing, e.g., `SELECT`, `UPDATE`, `INSERT`, `CREATE`, …

- SQL is NOT case sensitive: “SELECT”, “select”, and “SeLeCt” are all the same;

- A SQL command can use multiple lines;

- Don't forget that every SQL statement needs to be terminated with a `;`.

- SQL keywords are traditionally written in upper case letters, but that is not a requirement.

### 2.1 How to run SQL in Postgres?

Well, we have a variety of options to run our SQL statements in PostgreSQL:

- pgAdmin is the official web-based GUI for interacting with PostgreSQL databases
- `psql` is PostgreSQL's interactive command-line interface
- `%sql` and `%%sql` magic commands in Jupyter notebooks, which are provided by the `ipython-sql` package
- `DBI` and `RPostgres` packages in R;

---------------------------
### 2.1.1 `psql`

This is PostgreSQL's command-line tool that allows us to interactively run SQL statements as well as "meta" commands. I introduce a couple of useful `psql` meta commands here, but you can find all the other ones in Postgres documentations [here](https://www.postgresql.org/docs/current/app-psql.html) or a shorter version in this [cheatsheet](http://www.postgresonline.com/downloads/special_feature/postgresql83_psql_cheatsheet.pdf).

| Command | Usage                                         |
|---------|-----------------------------------------------|
| `\l`    | list all databases                            |
| `\c`    | connect to a database                         |
| `\cd`   | change directory                              |
| `\!`    | execute shell commands                        |
| `\i`    | execute commands from file                    |
| `\d`    | list tables and views                         |
| `\d+`   | list tables and views with additional info    |
| `\dt`   | list tables                                   |
| `\dt+`  | list tables with additional info              |
| `\h`    | view help on SQL commands                     |
| `\?`    | view help on psql meta commands               |
| `\q`    | quit interactive shell                        |

> Note that you don't need to terminate meta commands with `;`.

### 2.1.2 `ipython-sql` (`%sql` and `%%sql`)

`ipython-sql` is a package that enables us to run SQL statements right from a Jupyter notebook. In order to use it, we should load it first:

In [ ]:
%load_ext sql
%config SqlMagic.displaylimit = 30

Now we need the host address of where the database is stored, along with a username and a password.

It is always a bad idea to store login information directly in a notebook or code file because of security reasons. For example, you don't want to commit your sensitive login information to a Git repo.

In order to avoid that, it's better to store that kind of information in a separate file (e.g. `credentials.json`) and read the username and password into our IPython session. We will not do this here in this workshop as the DB server will be taken down afterwards.

Here are the necessary information for you to log in on the workshop's DB server:

In [ ]:
username = 'ssc_workshop'
password = 'sql_for_ds'
host = "ssc-2022-workshop.ct6ghoz7smhy.us-east-1.rds.amazonaws.com"
port = '5432'

Now we can establish the connection to the `world` database using the following code:

In [ ]:
%sql postgresql://{username}:{password}@{host}:{port}/world

Note that we have used the `%sql` line magic to interpret the line in front of it as a magic command. 

We can also use `%%sql` cell magic to apply the magic to an entire notebook cell.

A limited number of `psql` meta commands (e.g. `\l`, `d`) can also be executed here. This is made possible through the `pgspecial` package. For example, let's list all databases that exist on our PostgreSQL server:

In [ ]:
# %sql \l

Or list the relations (i.e. tables) in the current database:

In [ ]:
#%sql \d

---------------------------------------
#### Wait, isn't this a workshop? Let's get to work then!!
To learn you need to practice!

**Exercise 1:**

Retrieve the `name` and `population` columns from the `country` table:

In [ ]:
%%sql

**Exercise 2: `SELECT *`?**

What happens if you replace your column list with * in the SELECT statement?

In [ ]:
%%sql

Use `*` with care, since this may cause an unnecessary burden to your network. 
Besides, it make your SQL code less readable. If someone is not highly familiar with the database, they might not know what is being returned.

**Exercise 3: `LIMIT` keyword**

You can use the `LIMIT` keyword to limit the number of rows returned by the `SELECT` statement. 
Fill in the SQL query below to retrieve the `name` and `lifeexpectancy` columns from the `country` table, while limiting the number of rows to 10.

In [ ]:
%%sql


... name, ... 
   ... country
   LIMIT ...;

**Exercise 4: Aliases**

As you can see in the previous exercise, `lifeexpectancy` is hard to read. 
We can rename the columns in the SELECT statement's output by using the `AS` keyword. 
This will not change the `country` table, only the output of the SELECT statement. 

Fill in the SQL query below to retrieve the `name` and `lifeexpectancy` columns from the country table. Rename `lifeexpectancy` to `life_expectancy`. Again, limit the output to 15 rows.

In [ ]:
%%sql

...
    name,
    ... ... life_expectancy
  FROM ...
  ...;

**Exercise 5: `DISTINCT`**

What are the continents in the present in the `country` table? We can add the `DISTINCT` modifier to the `SELECT` clause to return only distinct results.  

> Note: `DISTINCT` is applied to **all columns** that we list in front of `SELECT`, and returns all distinct combinations of values stored in those columns.

In [ ]:
%%sql

... DISTINCT ...
  FROM ...;

**Exercise 6: Filtering with `WHERE`**

- The `WHERE` clause allows us to filter the rows we want;
- We can specify a condition (a Boolean expression) in the `WHERE` clause to retrieve only the rows for which the condition is true;
- Remember the filter verb in dplyr? It is the same idea!!

Retrieve the countries with a population higher than 150 million people.

In [ ]:
%%sql

... ...
  FROM ...
  ... population > 150000000;

- Some comparisons operator to use in `WHERE` clause

Operator | Condition |
---------|-----------|
`<`, `<=`, `=`, `>=`, `>` | ordinal comparisons | 
`LIKE`, `ILIKE`, `SIMILAR TO` | Pattern Matching | 
`BETWEEN` | Range filtering | 
`IN` | check belonginess (similar to `%in% `in R) |
`IS NULL` | check if is NULL |

**Exercise 7: derived columns**

SQL is able to make operations using columns. 

Retrieve the `name` column and `gnp_per_capita` by dividing the `gnp` column by the `population` column. 
Make sure to only calculate this for rows with population higher than 0. Remember to rename the column as `gnp_per_capita`.

In [ ]:
%%sql


...
    name,
    ... ... gnp_per_capita
  FROM ...
  ... ...
  LIMIT 15;

> Remember:  the `SELECT` statement is powerful, but not dangerous. Derived columns returned by Postgres are not saved anywhere, nor do they change existing columns.

**Exercise 8: Arranging with `ORDER BY`**

What are the countries with the highest `gnp_per_capita`? 
You can use the `ORDER BY` clause to rearrange the rows that is returned. By default, it will arrange the rows in ascending order. 
If you want in descend order you can add the `DESC` keyword. 

Retrieve the `name` column and `gnp_per_capita` by dividing the `gnp` column by the `population` column. 
1. Make sure to only calculate this for rows with population higher than 0. 
2. Remember to rename the column as `gnp_per_capita`. 
3. Order the rows in descending order.

In [ ]:
%%sql


...
    name,
    ... ... gnp_per_capita
  FROM ...
  ... population > 0
  ORDER BY ... DESC
  LIMIT 15;

> Note: if there’s a draw in `ORDER BY`, the rows are presented in arbitrary order;

---  
**Remember:**

The order of SQL keywords does matter: `SELECT`, `FROM`, `WHERE`, `ORDER BY`, `LIMIT`
    
---

## Data Types

We will not cover data types in detail. You can find all data types supported by PostgreSQL [here](https://www.postgresql.org/docs/current/datatype.html).

One thing that is worth noting is the `CAST` function, to convert from one data type to another.

**Example**

In [ ]:
%%sql 

SELECT CAST('1.2587465416874' AS NUMERIC(5,2));

### Nulls

- A null is marker to indicate that the value for a column is unknown, or not entered yet. A null is not equal to 0, or an empty string. In fact, **a null is not even equal to another null**!

- In `ORDER BY`, `NULL` values are considered either: the highest or the smallest possible value, depending on the DBMS. PostgreSQL treats `NULL` the highest possible value.

- Use `IS NULL` to match `NULL`. Do not try using equality. A `NULL` is not equal to another `NULL`.

- Although `NULL`s are not equal to each other, `DISTINC` treats them as if they were!

- How different environments show nulls:
  - `ipython-sql` -> `None`
  - psql -> blank space
  - pgAdmin -> `[null]`

------------------------

## `imdb` database 
Let's continue exploring the `WHERE` clause, but to keep things interesting, let's use another database.

In [ ]:
%config SqlMagic.displaylimit = 20

In [ ]:
%sql postgresql://{username}:{password}@{host}:{port}/imdb

In [ ]:
%%sql

/* Lets take a look at the movies table */

SELECT *
  FROM movies;

### Pattern matching

It is a quite common situation that we want to find rows for which the values of one or more columns match a particular pattern. In SQL, this can be done either using `LIKE` or by using regular expressions. The syntax is as follows:

```sql
SELECT
    column1, column2
FROM
    table1
WHERE
    column1 [NOT] LIKE '<pattern>'
;
```

Postgres provides us with two wild-cards that we can use with `LIKE`:
- `%` matches any string of characters
- `_` matches a single character.

Pattern matching with `LIKE` is case sensitive; however, Postgres also provides the `ILIKE` keyword that has the same functionality as `LIKE` but is case-insensitive (not part of standard SQL).

> **Note:** With `LIKE` or `ILIKE`, the entire string should match the pattern.

---

**Example:** Retrieve those movies from the `movie` table whose title contains the word `'violin'` (note that `LIKE` is picky about letter cases in strings!)

---

In [ ]:
%%sql

SELECT
    *
FROM
    movies
WHERE
    title ILIKE '%Violin%'
;


**Exercise 9:** 

Retrieve those movies from the `movie` table whose title starts with the word `'Zero'`.

In [ ]:
%%sql

**Exercise 10:** 

Retrieve those movies from the `movie` table whose title is 4 letters long and ends with the letter `'e'`.

In [ ]:
%%sql

## The relational model

SQL databases are based on the so-called relational model, it is based on the set theory in mathematics was introduced by by Edgar Codd (IBM) in 1970 ([more details here](https://en.wikipedia.org/wiki/Relational_model)). 
It's foundations in **set theory** is the reason you will here words like "tuples", "domain", "union", "cross product", etc.

We don't have time to cover the relational model in detail. But there are three things that you should keep in mind:


- **All operations** your perform in SQL result in a table (it could be an empty table).


- Primary keys: is one or more columns which uniquely identify each row (i.e., they are different for all rows); 
  - Examples: id, driver's license, SIN, license plate


- Foreign key: is one or more columns that uniquely identify each row of another table. For example
  - `id` in the `movies` table uniquely identify the movies;
  - `id` in the `names` table uniquely identify people; 
  - the `acting_roles` table relates people to movies using these primary keys to guarantee that there is no people working on a movie that doesn't exist, nor movies with people that don't exist (referential integrity);

In [ ]:
%sql select * from names LIMIT 5;

In [ ]:
%sql select * from movies LIMIT 5;

In [ ]:
%sql select * from acting_roles LIMIT 5;

There are also other useful models, which are less structured, which are known as `NoSQL` Databases. But this is outside the scope of this workshop.

## Aggregations

So far, we have seen many functions for various purposes. For example, `ROUND()` and `SQRT()` for math operations or `CHAR_LENGTH` and `SUBSTR()` for manipulating strings. As you may have noticed, these functions produce an individual output for each and every row of a column in an element-wise manner.

There is also a small class of useful functions in SQL called **aggregation** functions, which operate on groups of rows and summarize the data stored in those rows in the form of a single value. Here is a list of standard aggregation functions in SQL:

| Function   | What it computes                    |
|------------|-------------------------------------|
| `COUNT(*)` | Count of all rows in a table        |
| `COUNT()`  | Count of non-null rows of a column  |
| `MIN()`    | Minimum value in a column           |
| `MAX()`    | Maximum value in a column           |
| `AVG()`    | Average of values in a column       |
| `SUM()`    | Total sum of values in a column     |

A couple of points to remember:

- Except for `COUNT(*)`, all aggregation functions ignore `NULL`s
- In addition to numbers, `MIN()` and `MAX()` also work with strings.

---

**Example:** Find the population of the world according to the `country` table in the `world` database.

---

In [ ]:
%sql postgresql://{username}:{password}@{host}:{port}/world

In [ ]:
%%sql

SELECT
    SUM(population)
FROM
    country
;

There are a few things that we need to remember when using aggregation functions:

- It is valid to have multiple aggregations in a SQL query, but it is NOT possible have both aggregations and regular columns in a single query:

```sql
-- This is CORRECT:
SELECT
    AVG(lifeexpectancy), SUM(population)
FROM
    country
WHERE
    continent = 'North America'
;

-- This is WRONG:
SELECT
    AVG(lifeexpectancy), name
FROM
    country
WHERE
    continent = 'North America'
;
```

There is only one exception to the latter rule, and that's when we have a `GROUP BY` clause (we'll learn about that in a bit).

- An aggregation function CANNOT be used in the `WHERE` clause, because in SQL `WHERE` processes rows before aggregations. For example, we can't find the name of countries with above-average populations using the following query:

```sql
-- This is WRONG:
SELECT
    name
FROM
    country
WHERE
    population > AVG(population)
;
```

It is, of course, possible to write a query to answer the above question, but we have to wait until we learn about subqueries!

## Grouping

If we divide a table into groups of rows based on values of one or more columns, that is called **grouping**. For example, in the `country` table of the `world` database, we find several countries located in the same continent. In this situation, we can group the rows in our `country` table based on the values in the `continent` column. In this way, we would end up with bunch of "sub-tables": A sub-table for all rows where `continent = 'Asia'`, another sub-table for all rows where `continent = 'Europe'`, and so on.

The formal syntax of the grouping operation in SQL looks like this:

```sql
SELECT
    grouping_columns, aggregated_columns
FROM
    table1
WHERE
    condition
GROUP BY
    grouping_columns
ORDER BY
    grouping_columns
```

Typically, it is not the sub-tables themselves that we're interested in, but some sort of summary statistics:
For example, we might want to know the average population for each continent, i.e. for each sub-table or group. In order to do this, we can use aggregation functions that learned about them in the previous section. The question of **"what is the average population of countries in each continent"** can be asked in SQL terms as follows:

In [ ]:
%%sql

SELECT
    continent, AVG(population)
FROM
    country
GROUP BY
    continent
;

**Important points:**

1. If your SQL query involves
  - grouping,
  - filtering with `WHERE`, and
  - sorting with `ORDER BY`,
  
then the `GROUP BY` clause MUST appear between `WHERE` and `ORDER BY`.

2. There can't be any non-aggregated column in a grouping query, except for the columns which are used for grouping (remember the exception I talked about with aggregation functions?). In other words, a non-aggregated column in the `SELECT` clause MUST appear in the `GROUP BY` clause as well.

3. If there are null values in the grouping column, there will be a separate group for null values in the results.

<div class="alert alert-info" style="color:black">

<font size="+2">**Activity (3 min)**</font>

Write a query to return the average and maximum population of cities in the `city` table for China, India, Canada, US, Australia, and Russia. The corresponding country codes are `CHN, IND, CAN, USA, AUS` and `RUS`.

Show the results for each country using the corresponding country code.

In [ ]:
%%sql

SELECT
    countrycode,
    AVG(population),
    MAX(population)
FROM
    city
WHERE
    countrycode IN ('CHN', 'IND', 'CAN', 'USA', 'AUS', 'RUS')
GROUP BY
    countrycode
;

### Filtering revisited: the `HAVING` clause

So far, we have used the `WHERE` clause to filter rows. However, I mentioned before that aggregation functions cannot be used inside a `WHERE` clause.

There is another reserved keyword, `HAVING`, for when we need to do filtering using aggregated values. The syntax is as follows (order is important!):

```sql
SELECT
    grouping_columns, aggregated_columns
FROM
    table1
[WHERE
    condition]
GROUP BY
    grouping_columns
HAVING
    group_condition
[ORDER BY
    grouping_columns]
```

To summarize:

- `WHERE` filters rows **before** grouping (or any other operation)
- `HAVING` filters groups **after** grouping

---

**Example:**

Write a query to return the average and maximum population of cities for countries that have at least 60 cities listed in the `city` table.

Show the results for each country using the corresponding country code. Order groups by the number of cities of each country in descending order. Also, convert the returned values to integer type.

---

In [ ]:
%%sql

SELECT
    countrycode,
    AVG(population)::INT,
    MAX(population)::INT,
    COUNT(population) AS count
FROM
    city
GROUP BY
    countrycode
HAVING
    COUNT(*) > 60
ORDER BY
    count DESC
;

Note that just like with the `WHERE` clause, the expression used for filtering with `HAVING` does not necessarily need to appear in the `SELECT` clause. For instance, the `HAVING` clause will still do its job even if `COUNT(population)` is omitted from the `SELECT` clause:

In [ ]:
%%sql

SELECT
    countrycode,
    AVG(population)::int,
    MAX(population)::int
FROM
    city
GROUP BY
    countrycode
HAVING
    COUNT(*) > 60
ORDER BY
    COUNT(*) DESC
;

**Note:** A `GROUP BY` clause can be considered as equivalent to using `DISTINCT` if no aggregate functions are used:

In [ ]:
%%sql

SELECT
    continent
FROM
    country
GROUP BY
    continent
;

In [ ]:
%%sql

SELECT
    DISTINCT continent
FROM
    country
;

**Note:** Neither `GROUP BY` nor `DISTINCT` ignore null values.

As long as they are aggregated, columns appearing in the `HAVING` clause don't necessarily need to be present in the `SELECT` clause. For example, here we're retrieving the name of continents having at least 40 countries:

In [ ]:
%%sql

SELECT
    continent
FROM
    country
GROUP BY
    continent
HAVING
    COUNT(*) >= 40
;

## Joins

Joins are probably the most fundamentally important operation in relational databases.

The reason is that the whole idea of such databases is that data can be broken down into various tables that are related to each other, and can be joined together whenever related information from multiple tables is required. Consider the following query as an example:

---

**Example:** Write a query that returns the name of all countries along with their corresponding continents and their cities.

---

As we've been working with the `world` database, we immediately notice that information about countries and cities are stored in two different tables, so we should somehow **combine** or **_join_** the data from the two tables. 

The syntax for a joining tables in SQL is as follows:

```sql
SELECT
    columns
FROM
    left_table
join_type
    right_table
ON
    join_condition
WHERE
    row_filter
GROUP BY
    columns
HAVING
    group_filter
ORDER BY
    columns
;
```

In this section, we'll learn how to do a **join** to answer the question we posed for the `world`, but I prefer to use a smaller database called `faculty` to demonstrate various joining methods first, and then use our larger databases.

In [ ]:
%sql postgresql://{username}:{password}@{host}:{port}/faculty

Let's take a look at some tables in this database:

In [ ]:
%sql SELECT * FROM instructor;

In [ ]:
%sql SELECT * FROM instructor_course;

### Cross join

A cross join is the simplest way to join two tables:

By cross-joining tables A and B, we match each every row from table A with every row from table B.

In other words, a cross-join returns all combinations of rows from table A and table B. This type of join is also sometimes called _the Cartesian product_ of two relations or tables:

In [ ]:
%config SqlMagic.displaylimit = 200

In [ ]:
%%sql

SELECT
    *
FROM
    instructor
CROSS JOIN
    instructor_course
;

**How to deal with ambiguous column names**

Now suppose that we want to return only the names of the instructors and their IDs from the `instructor` table, and names of courses and their IDs from the `course` table. Since there is a column named `id` in both tables, we cannot use `id` in the `SELECT` clause, because it is ambiguous.

In this situation, we should either prepend the column name by the full name of its parent table (e.g. `instructor.id`), or we can create table aliases using the keyword `AS` (just like we did before with columns) and prepend the column name with the parent table alias. A table name followed by a dot and the name of a column is called a _qualified name_. Here is an example of using qualified names for ambiguous column names:

In [ ]:
%%sql

SELECT
    name, i.id, course, ic.id
FROM
    instructor AS i
CROSS JOIN
    instructor_course AS ic
LIMIT 10
;

- The keyword `AS` can be dropped
- Table aliases only exist during the execution of a statement
- Using table aliases is a great way to reduce clutter in SQL join statements
- Once you create an alias for a table, you should only use the alias to refer to that table in the statement. For example, the following query would throw an error:

```sql
-- This is WRONG
SELECT
    instructor.name, instructor.id, course, ic.id
FROM
    instructor AS i
CROSS JOIN
    instructor_course AS ic
;
```

### Inner join

Except for a cross join, all other types of joins use a condition using the `ON` keyword to figure out which rows from the two tables to pair up. An inner join is a type of join that only returns the matching rows from the left and right tables. The image below ([source](https://www.postgresqltutorial.com/postgresql-joins/)) shows Venn diagram of an inner join:

<img src="img/inner_join.png" width="250"/>

For example, in our `instructor` table there are some instructors who are assigned one or more courses in the `instructor_course` table, some who are not. Similarly, there are courses in the `instructor_course` table that have an instructor, and some that don't have an instructor yet. With an inner join based on `instructor.id` and `instructor_course.id` columns, we would retrieve matching rows, meaning that only instructors are retrieved that have one or more assigned courses, and vice versa:

In [ ]:
%%sql

SELECT
    name, i.id, ic.instructor_id, course
FROM
    instructor AS i
INNER JOIN
    instructor_course AS ic
ON
    i.id = ic.instructor_id
;

In the above returned table, "Quan" and "Varada" are missing as instructors since they are not yet assigned any courses. Also, the courses "Web & Cloud Computing", "Parallel Computing", and "Introduction to Optimization" are missing, since there not yet any instructors assigned for these courses.

> **Note:** The `INNER` keyword is optional.

### Natural join

For joins involving a join condition, e.g. inner or self joins, we have so far explicitly specified the matching condition. In a situation that columns in different tables have the same name and we want to simply match rows with similar values **in all similarly named columns**, we can do a **natural join** using the keywords `NATURAL JOIN`. For example, the `id` column in the `course_cohort` refers to the `id` column let's find which courses are offered for which cohorts using a natural join:

In [ ]:
%sql SELECT * FROM course_cohort;

In [ ]:
%%sql

SELECT
    ic.course, cc.cohort
FROM
    instructor_course ic
NATURAL JOIN
    course_cohort cc
;

If there are no matching columns in the two tables, `NATURAL JOIN` acts like `JOIN ... ON TRUE` and results in a cross-product join between the participating tables.

### Outer joins

An outer join is a type of join that returns all the rows from one or both of the tables that takes part in the joining.

**Outer joins** are useful in questions that involve **missing values**.

#### Left outer join

In the joining process, the first table from which data is retrieved using `SELECT` is called the **left** table, and the table that is joined onto that is called the **right** table. In other words, the first table that appears in the query is the left table (table on the left of the query), and the one appearing later is the right table (table on the right of the query).

A left outer join is a type of join that returns all rows from the left table (matching or not), in addition to the matching rows from both tables. The non-matching rows from the left table are assigned null values in the columns that belong to the 
right table. This is schematically shown in the diagram below ([source](https://www.postgresqltutorial.com/postgresql-joins/)):

<img src="img/left_join.png" width="250"/>

For example, in the [inner join](#Inner-join) example, instructors who don't teach any course are not returned by the join operation. Let's say we want to retrieve a list of all instructors and the courses they teach, as well as those who don't teach any courses:

In [ ]:
%%sql

SELECT
    name, i.id, ic.instructor_id, course
FROM
    instructor AS i
LEFT OUTER JOIN
    instructor_course AS ic
ON
    i.id = ic.instructor_id
;

> **Note:** The keyword `OUTER` is optional.

How can this be helpful? As an example, we can return the name of instructors who don't teach any courses with the following query:

In [ ]:
%%sql

SELECT
    name
FROM
    instructor AS i
LEFT JOIN
    instructor_course AS ic
ON
    i.id = ic.instructor_id
WHERE
    ic.course IS NULL
;

#### Right outer join

A right join acts exactly in the same way as a left join, except that it keeps all rows from the right table and only the matching ones from the left table. The diagram below demonstrates a right join schematically ([source](https://www.postgresqltutorial.com/postgresql-joins/)):

<img src="img/right_join.png" width="250"/>

Let's retrieve a list of all courses and their appointed instructors, as well as those courses without an instructor:

In [ ]:
%%sql

SELECT
    name, i.id, ic.instructor_id, course
FROM
    instructor AS i
RIGHT OUTER JOIN
    instructor_course AS ic
ON
    i.id = ic.instructor_id
;

Now, let's find out which courses do not have an appointed instructor yet:

In [ ]:
%%sql

SELECT
    course
FROM
    instructor AS i
RIGHT OUTER JOIN
    instructor_course AS ic
ON
    i.id = ic.instructor_id
WHERE
    i.id IS NULL
;

#### Full outer join

A full outer join is the combination of a left and right join: it retrieves **matching and non-matching** rows from **both** tables. Take a look at the schematic diagram of a full outer join ([source](https://www.postgresqltutorial.com/postgresql-joins/)):

<img src="img/full_outer_join.png" width="250"/>

Let's do a full outer join between the `instructor` and `instructor_course` tables to retrieve all instructors and courses:

In [ ]:
%%sql

SELECT
    name, i.id, ic.instructor_id, course
FROM
    instructor AS i
FULL OUTER JOIN
    instructor_course AS ic
ON
    i.id = ic.instructor_id
;

We can now write a query to find instructors who are free to teach a course, and courses that need an instructor:

In [ ]:
%%sql

SELECT
    name, course
FROM
    instructor AS i
FULL OUTER JOIN
    instructor_course AS ic
ON
    i.id = ic.instructor_id
WHERE
    i.name IS NULL
    OR
    ic.course IS NULL
;

---

**Question:** What's the difference between a cross join and a full outer join?

---

<div class="alert alert-info" style="color:black">

<font size="+2">**Activity (3 min)**</font>
    
Write a query that returns the name of countries and the number of their listed cities, sorted by the latter in descending order. Your query should only return those countries with more than 80 listed cities.

In [ ]:
%sql postgresql://{username}:{password}@{host}:{port}/world

In [ ]:
%%sql

SELECT
    c.name, COUNT(*)
FROM
    country c
JOIN
    city ci
ON
    c.code = ci.countrycode
GROUP BY
    c.name
HAVING
    COUNT(*) > 80
ORDER BY
    COUNT(*) DESC
;

<div class="alert alert-info" style="color:black">

<font size="+2">**Activity (3 min)**</font>
    
Write a query to find out if there are any countries for which no cities are listed?

In [ ]:
%%sql

SELECT
    c.name, ci.name
FROM
    country c
LEFT JOIN
    city ci
ON
    c.code = ci.countrycode
WHERE
    ci.name IS NULL
;

## Subqueries

There is a particular type of question that we have avoided so far for our SQL queries, and that is one for which we need the result of a second query to be able to run the first query. Take the following question as an example:

---

**Example:** Using the `world` database, find the countries with surface area above the average value of all countries in the world.

---

This query looks simple. You might be tempted to try

```sql
-- This will NOT work
SELECT
    name
FROM
    country
WHERE
    surfacearea > AVG(surfacearea)
;
```

but we've learned before that aggregate functions **cannot** be used within a `WHERE` clause.

To answer this question, we need to query the database twice: once to obtain the average surface area, and once to actually retrieve the rows that satisfy the condition.

However, we don't need to do that in two separate queries and manually take the data coming from the first query and use it in the second. We can use a **subquery** to do that for us.

A subquery is a `SELECT` statement that is incorporated into another SQL statement. For example, the query that computes the average surface area is:

```sql
SELECT
    AVG(surfacearea)
FROM
    country
;
```

We can use this intermediate information in our original query by embedding the above query in the `WHERE` clause of the original query:

```sql
SELECT
    name
FROM
    country
WHERE
    surfacearea > (
        SELECT AVG(surfacearea) FROM country
    )
;
```

In [ ]:
%sql postgresql://{username}:{password}@{host}:{port}/world

In [ ]:
%%sql

SELECT
    name
FROM
    country
WHERE
    surfacearea > (
        SELECT
            AVG(surfacearea)
        FROM
            country
    )
;

Note that:

- A subquery should always be enclosed in parentheses, e.g. `(SELECT ...)`

- Subqueries should **not** be terminated by a semi-colon, as opposed to regular queries

- Sometimes the main SQL statement is called the **outer query** and the subquery is called the **inner query**

- A subquery can be used in the `SELECT`, `FROM`, `WHERE`, and `HAVING` clauses, but most commonly in the `WHERE`.

- A subquery in the `SELECT` clause should always return a single value, not a column or rows of values.

<div class="alert alert-info" style="color:black">

<font size="+2">**Activity (3 min)**</font>
    
Use a subquery in the `SELECT` clause to **double-check** if the returned rows do satisfy the condition of `surfacearea > AVG(surfacearea)`?

In [ ]:
%%sql

SELECT
    name,
    surfacearea / (SELECT AVG(surfacearea) FROM country)
        AS ratio
FROM
    country
WHERE
    surfacearea > (
        SELECT AVG(surfacearea) FROM country
    )
ORDER BY
    ratio
;

<div class="alert alert-info" style="color:black">

<font size="+2">**Activity (3 min)**</font>
    
Retrieve the name of countries whose capital cities have a population larger than 5 million.
    
(You can do this using a SQL join as well as we'll do after this activity, but here I want you to use a subquery for practice)
    
**Hint:** The id of the capital of each country is stored in the `capital` column of the `country` table

In [ ]:
%%sql

SELECT
    name
FROM
    country
WHERE
    capital IN (
        SELECT id
        FROM city
        WHERE population > 5000000
    )
;

As mentioned earlier, we can rewrite this query using a **join**:

In [ ]:
%%sql

SELECT
    co.name
FROM
    country co
JOIN
    city ci
ON
    co.capital = ci.id
WHERE
    ci.population > 5000000
;

Using a subquery is actually another way to gain access to data stored in other tables.

Typically, joins can be rewritten as a subquery and vice-versa, so what's the difference?

- Subqueries tend to be more readable and more intuitive

However:

- Subqueries cannot be used if you need to include columns from the inner query in your results